In [1]:
import pandas as pd

In [2]:
file_path = '../data/data_manipulation_resources/AB_NYC_2019.csv'
df = pd.read_csv(file_path)

In [4]:
df.head(3)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365

In [5]:
df2 = df.set_index('id')
df2.head(3)

,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
id,,,,,,,,,,,,,,,
2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365

In [6]:
df.name[2539]

"BROWNSTONE BROOKLYN'S FINEST in NYC"

In [13]:
df2.groupby('neighbourhood_group').mean().availability_365

/var/folders/cp/2vg0mq953918v2_1xmh8chvr0000gn/T/ipykernel_2271/3862498178.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby('neighbourhood_group').mean().availability_365

neighbourhood_group
Bronx            165.758937
Brooklyn         100.232292
Manhattan        111.979410
Queens           144.451818
Staten Island    199.678284
Name: availability_365, dtype: float64

In [24]:
df3 = df2.groupby('neighbourhood_group').mean().availability_365
df3.reset_index()

/var/folders/cp/2vg0mq953918v2_1xmh8chvr0000gn/T/ipykernel_2271/1293079930.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df3 = df2.groupby('neighbourhood_group').mean().availability_365

  neighbourhood_group  availability_365
0               Bronx        165.758937
1            Brooklyn        100.232292
2           Manhattan        111.979410
3              Queens        144.451818
4       Staten Island        199.678284

In [23]:
df3.reset_index(drop=True)

0    165.758937
1    100.232292
2    111.979410
3    144.451818
4    199.678284
Name: availability_365, dtype: float64